Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་དུ་རྗེས་སུ་མཐུན་པར་བརྟག་པར་བྱའོ། །གནས་གཙང་མར་མ་ཉམས་པའི་མོད་ལ། དཀྱིལ་འཁོར་དེར་དགོད་པར་བྱ་སྟེ།
en: Once he has found a clean spot, the vidyā holder should set up the maṇḍala there.

source: ས་དང་། བ་བྱུང་དང་། ཡང་དག་པར་ལྡན་པའི་དཀྱིལ་འཁོར་གྲུ་བཞི་བྱའོ། །ཁོར་ཡུག་ཏུ་ཁྲུ་བཞི་པ།
en: He should build it using a mixture of clay and cow dung to form the shape of a square with sides measuring four cubits each.

source: ལེགས་པར་བྱུགས་ཤིང་ཤིན་ཏུ་འཇམ་པ། བཻ་ཌཱུརྱའི་ཁ་དོག་ཏུ་བྱའོ།
en: Its surface should be wiped clean, be soft and smooth, and have the color of beryl.

source: །དཀྱིལ་འཁོར་ལ་ཚོན་སྣ་ཚོགས་པ་མཛེས་པས་ཕྱེ་བའི་ཐིག་གདབ་སྟེ།
en: The vidyā holder should delimit the sections of this divine maṇḍala using a thread of various colors, making the sections the same shape and size.

source: ཆ་མཉམ་པར་ཕྱེ་ནས་ཟུར་བཞི་པ་ལོགས་བཞི་པ། སྒོ་བཞི་རྣམ་པར་ཕྱེ་བའི་དཀྱིལ་འཁོར་མཆོག་གི་ཐིག་གདབ་བོ།
en: He should thus demarcate the four corners, the four sides, and the four doors that constitute a supreme maṇḍala. “

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་ཡང་། དཀྱིལ་འཁོར་ཁྲུའི་ཚད་ལ་རེ་ཁཱ་ལྔ་བྱས་པ་སྣ་ཚོགས་པའི་གཟུགས་མཛེས་པས་ཐིག་གདབ་བོ།
en: Within the central area of this maṇḍala the vidyā holder should use the thread to demarcate an inner maṇḍala that is one cubit across and has five parallel lines.

source: །པདྨའི་རི་མོ་དང་། མདུང་རྩེ་གསུམ་པ་དང་། རྡོ་རྗེའི་རི་མོ་གསུམ་པ་དག་གོ། །ཨུཏྤ་ལ་བཞི་པའམ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ནི་ལྔ་པར་བཤད་དོ།
en: All along these lines he should skillfully draw various shapes: a row of lotuses along the first line, a row of tridents along the second, a row of vajra scepters along the third, a row of blue lotuses along the fourth, and a row of precious great jewels along the fifth.

source: །སྙིང་པོའི་དཀྱིལ་འཁོར་གྱི་འཁོར་ཡུག་ཏུ་འབར་བའི་ཕྲེང་བ་བྱེད་དུ་གཞུག་གོ།
en: Each is surrounded by a blazing garland of flames. “

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་གྱི་གནས་སོ། །པདྨ་དཀར་པོ་ཞེས་བྱ་བ་འདབ་མ་སུམ་ཅུ་རྩ་གཉིས་པ། གེ་སར་དང་། ཟེའུ་འབྲུ་དང་བཅས་པའི་པདྨ་བྱ་སྟེ།
en: In the center of the inner maṇḍala, the vidyā holder should draw a puṇḍarīka lotus that has thirty-two petals, stamens, and a pericarp.

source: དེ་ལ་རིག་པའི་ལྷ་མོ་གཟུགས་ཇི་ལྟར་མཛེས་པ་དགོད་པར་བྱའོ།
en: He should draw the vidyā goddess there, skillfully executing her specific features.

source: །ཇི་ལྟར་རས་རིས་འདི་ལ།
en: He should draw the figures in this maṇḍala as precisely as if he were drawing them on a canvas of fine cotton.

source: གཟུགས་པདྨ་དཀར་པོ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་བྲིས་ནས་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་མཛེས་པ་དང་། ཞི་བ་དང་། ཁྲོ་གཉེར་ཅན་མ། དྲག་པོ་སྣ་ཚོགས་པའི་གཟུགས་འཆང་བ།
en: On the petals of the white lotus he should draw the deities of the maṇḍala in their various divine forms, some peaceful and some grimacing wrathfully.

source: མཚོན་ཆ་སྣ་ཚོགས་ཐོགས་པ་དཀྱིལ་འཁོར་གྱི་ཚད་ཇི་ལྟ་བ་བཞིན་དུའོ།
en: They each hold various implements and are to be depicted according to the conventions of the maṇḍala.

source: །རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། གོས་སྣ་ཚོགས་པ་འཆང་བ་སྐྱེས་པ་ལོ་བཅུ་དྲུག་པའི་གཟུགས་དང་།
en: They are adorned with all kinds of ornaments and wear various garments.

source: བུ་མོ་ལོ་བཅུ་དྲུག་པའི་གཟུགས་འཛིན་པ་བསྲེས་པ་རྟག་ཏུ་བྲིས་ནས།
en: Sixteen of them possess a male form and sixteen a female form, with the two genders alternating in sequence.

source: པདྨའི་གདན་གྱིས་བརྒྱན་ཅིང་། ཐམས་ཅད་པདྨ་འཆང་བ་བྱེད་དུ་གཞུག་གོ།
en: The vidyā holder should draw all these deities seated on lotus seats and holding a lotus. “

source: །སྙིང་པོའི་དཀྱིལ་འཁོར་གྱི་གྲྭ་བཞི་རུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བྱེད་དུ་གཞུག་སྟེ། གོ་ཆ་དང་ཡ་ལད་བགོས་པ། དྲག་པོའི་གཟུགས་འཇིགས་པར་བྱེད་པའོ། །ཕྱིའི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་བྱ་སྟེ།
en: The vidyā holder should draw the Four Great Kings on the inside of the four corners, each with their cuirasses and coats of mail fastened on and in forms that inspire dread.

source: ཁོར་ཡུག་ཏུ་མཚན་མའི་ཕྱག་རྒྱ་ཐམས་ཅད་ལ་པདྨའི་གདན་འཆང་བའོ།
en: Outside the maṇḍala he should draw a surrounding row of various emblems that are evenly spaced and hands displaying various mudrā gestures, all supported on lotus seats.

source: །སྒོ་བཞིའི་གནས་རྣམས་སུ་དཀྱིལ་འཁོར་གྱི་ལྷ་བྱའོ། །གང་གཱ་དང་། ཤཱི་ཏྲ་དང་། འཇིགས་མ་དང་། དཔེ་མེད་མ་དང་།
en: In the four doors he should draw, respectively, the maṇḍala deities Gaṅgā, Śītā, Bhīmā, and Anaupamyā.

source: ནོར་བུ་བཟང་པོ་དང་། ཀི་ལཱི་ཀི་ལ་དང་། གཙིགས་ཞལ་མ་སྟེ། དཀྱིལ་འཁོར་གྱི་ལྷ་འདི་རྣམས་བྲི་བར་བྱའོ།
en: He should also draw the maṇḍala deities Maṇibhadra, Kelin, Kelikila, and Vikaṭānana.

source: །ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་རི་བོའི་ཕྲེང་བ་དག་ལ་མེ་ཏོག་དང་། ལྗོན་ཤིང་སྣ་ཚོགས་པའི་ལྕུག་མས་ཁྱབ་ཅིང་། ཚོན་སྣ་ཚོགས་པས་རྣམ་པར་མཛེས་པ་བྲི་བར་བྱའོ། །དཀྱིལ་འཁོར་གྱི་བྱ་བ་ལེགས་པར་མཐར་ཕྱིན་པ་དང་།
en: Surrounding the outside of the maṇḍala, the vidyā holder should draw rings of mountains covered with various flowers, trees, and vines, painting them in various distinct colors. “

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་རྒྱན་ལ་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཚོན་སྣ་ལྔས་མཛེས་པའི་བ་དན་བརྒྱ་དང་། སྣ་ཚོགས་པའི་གཟུགས་མཛེས་པ་དང་། རྣམ་པར་བཀྲ་བའི་བུམ་པ་གང་བ་དང་།
en: The vidyā holder should complete the maṇḍala in every detail and then skillfully adorn the entire maṇḍala with hundreds of variously shaped banners in five beautiful colors.

source: གཏོར་མ་དང་། དྲིལ་བུ་མཛེས་པ་དང་། གང་བའི་བུམ་པ་དང་། བུམ་བུ་དང་། དྲི་སྣ་ཚོགས་ཀྱི་ཆུས་ཡོངས་སུ་གང་བ་དང་།
en: He should skillfully arrange brightly adorned vases filled with a bali offering, bells, and jars and pitchers filled with water perfumed with various scents.

source: རོ་སྣ་ཚོགས་པའི་གཏོར་མ་བཞག་ནས། ཁམ་ཕོར་དང་། རིལ་བ་གང་བ་དང་། དྲི་སྣ་ཚོགས་ཀྱིས་བྱུག་པ་དང་། བདུག་པ་སྣ་ཚོགས་པས་མཛེས་པ་དང་།
en: He should offer nicely arranged bali articles of various flavors, including bowls of rice pudding, as well as various fragrances, scented oils, and incense.

source: མེ་ཏོག་གི་ཕྲེང་བ་གཅལ་དུ་བཀྲམ་པ་དང་། འབྲས་ཡོས་དང་། ཡུངས་ཀར་ཉིད་དང་།
en: He should strew the maṇḍala with flowers and wreaths and sprinkle it with rice grains and mustard seeds.

source: སྣ་ཚོགས་པའི་འབྲས་བུ་རྣམས་དང་། བཟའ་བའི་རྣམ་པ་གཟུགས་སྣ་ཚོགས་པ་བཞག་ནས། འབྲས་བུ་སྣ་ཚོགས་མཛེས་པ་རྣམས་བཞག་སྟེ། ཁོར་ཡུག་ཏུ་མར་མེའི་ཕྲེང་བ་དང་།
en: He should set out various fruits and food products, including a variety of delicious fruits, and place rows of lamps all around it.

source: གསེར་དང་། དངུལ་ལས་བྱུང་བའི་སྣོད་དྲིས་གང་བ་རྣམས་བཞག་གོ། །ཐམས་ཅད་ཇི་ལྟར་འབྱོར་པ་བྱ་སྟེ།
en: He should include silver and golden vessels filled with fragrances.

source: དཀྱིལ་འཁོར་གཞལ་དུ་མེད་པ་ལས་དམན་པ་ཉིད་དུ་མི་བྱའི་ལྷག་པ་ཉིད་བྱེད་དུ་གཞུག་གོ།
en: He should offer all these articles according to their availability and the size of the maṇḍala, but more is preferable to less.

source: །དཀྱིལ་འཁོར་གྱི་ལས་རྣམས་ཇི་ལྟ་བ་བཞིན་དུ་གུས་པ་དང་། སྟོབས་དང་བརྩོན་འགྲུས་ཀྱིས་བྱའོ།
en: He should perform the maṇḍala tasks according to the strength of his devotion and energy. “

source: །རིག་སྔགས་འཆང་གིས་གཙང་བར་གྱུར་ནས། ལེགས་པར་ཁྲུས་བྱས་ཏེ་གོས་གཙང་མ་བགོས་ནས།
en: He should then purify himself ritually, take a bath, and put on clean clothes.

source: སྲུང་བའི་ཆོ་གས་ཕྱོགས་བཅིང་བ་དང་། དཀྱིལ་འཁོར་བཅིང་བ་དང་། མཚམས་བཅིང་བ་དང་།
en: He should perform the rite of protection and bind the directions, maṇḍala, and the area.

source: སྲུང་བ་ཆེན་པོ་ཡང་བྱེད་དུ་གཞུག་གོ།
en: He should also perform the great protection.

source: །དེ་ནས་གསང་སྔགས་ཀྱི་ལས་དང་། ཕྱག་རྒྱའི་ལས་བླ་ན་མེད་པར་བྱའོ། །དེ་ནས་སེམས་ཅན་གཞུག་པར་བྱ་སྟེ།
en: After all that, he should perform the supreme ritual sequence that involves reciting the mantra and displaying the mudrā.

source: དཀྱིལ་འཁོར་གང་འདོད་པར་བཅུག་ནས་ཐམས་ཅད་ཀྱི་དམ་ཚིག་དང་། ཕྱག་རྒྱ་སྦྱིན་དུ་གཞུག་གོ།
en: He should then usher in the disciples who wish to be initiated into the maṇḍala, and when they have all entered, he should display the samaya mudrā to them.

source: །ཕྱག་བྱ་བ་དང་། བསྐོར་བ་ལ་ཐམས་ཅད་བཅུག་ནས།
en: They should all bow to and circumambulate the maṇḍala clockwise. “

source: སྙན་གསན་དབབ་པ་དང་སྤྱན་དྲང་བར་བྱ།
en: The vidyā holder should then summon and receive the deities, perform the bali procedure, and offer flowers and incense.

source: ལས་ཀྱི་ཆོ་གས་གཏོར་མ་སྦྱིན་པར་བྱ།
en: When the required mantra recitation is over and the ritual complete, he should perform the rite of dismissing.

source: མེ་ཏོག་དང་བདུག་པ་དབུལ་བར་བྱ། བཟླས་པའི་ལས་རྣམས་དང་། ལས་ཐམས་ཅད་མདོར་བསྡུས་པ་བྱས་ནས། གཤེགས་སུ་གསོལ་བ་འདིར་བྱའོ། །དཀྱིལ་འཁོར་ན་གནས་པའི་ལྷ་རྣམས་ལ་གཏོར་མའི་ལས་ཀྱི་ཆོ་ག་དང་། དེ་བཞིན་དུ་མེ་ཏོག་དང་བདུག་པ་ཕུལ་བ་ནས་དཀྱིལ་འཁོར་ན་གནས་པ་རྣམས་གཤེགས་སུ་གསོལ་ལོ།
en: He should also perform the bali procedure for the deities who dwell in the maṇḍala, offer them flowers and incense, and then dismiss them all. “

source: །གང་གི་ཚེ། གསང་སྔགས་རྣམས་དང་། ཆོ་ག་ཞིབ་མོ་ཆེན་པོའི་གཟུངས་རབ་ཏུ་འཇུག་པ་ན་སའི་མཐིལ་དུ་རས་རིས་འབར་བའི་མོད་ལ་འོད་ཟེར་འབྱིན་པར་བྱེད་དེ།
en: When the entry mantras are recited, the ground will shake violently, and in the same instant the painting will blaze and radiate rays of light.

source: དཀྱིལ་འཁོར་མཐོང་ཞིང་གསང་སྔགས་འཆང་ཡང་བར་སྣང་ལ་གནས་སོ། །དེའི་སྐད་ཅིག་ལ་ཏིང་ངེ་འཛིན་ཐོབ་སྟེ།
en: The vidyā holder beholding the maṇḍala will instantly rise up and hover in midair, and at the same moment he will obtain samādhi.

source: དཀྱིལ་འཁོར་དུ་ཞུགས་པའི་མོད་ལ།
en: Once he has entered the maṇḍala, he is certain to obtain all accomplishments.

source: ཆོ་ག་ཞིབ་མོའི་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་། དངོས་གྲུབ་ཐམས་ཅད་རྟག་ཏུ་མྱུར་དུ་འབྱུང་ལ་རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་གྱི་དབུས་ནས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་ཐོས་པར་འགྱུར་རོ།
en: He will quickly obtain the supreme accomplishment of the rite, and a voice will issue forth from the center of the maṇḍala of the king of vidyās, applauding the vidyā holder. “

source: །རིག་པའི་རྒྱལ་པོའི་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་དོན་ཡོད་ཞགས་པའི་དངོས་གྲུབ་བརྗོད་དོ།
en: The vidyā holder will attain an accomplishment of Amoghapāśa, the supreme accomplishment of the king of vidyās.

source: །ཇི་ལྟར་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་མྱུར་དུ་འཛིན་ནོ། །འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་དངོས་གྲུབ་ཐོབ་སྟེ་འདི་ལ་ཐེ་ཙོམ་མེད་དོ།
en: He will soon be able to retain memories of whatever arises in his mind, and he will attain both worldly and supramundane accomplishments. There is no doubt about this.

source: །སེམས་ཅན་དཀྱིལ་འཁོར་དུ་ཞུགས་པ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པ་དང་།
en: All beings who enter this maṇḍala will not be liable to turn back.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་ཡང་འགྱུར་རོ། །བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འདུག་ནས་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱེད་དོ།
en: They will obtain the prophecy of their unsurpassable perfect awakening, of sitting on the seat of awakening, and of turning the wheel of Dharma.

source: །སེམས་ཅན་གང་དཀྱིལ་འཁོར་དེ་མཐོང་ནས་སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་དང་། མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ་རྣམས་དང་།
en: Those who see this maṇḍala will be cleansed of all their wrongdoings and obscurations such as the five acts of immediate retribution that would otherwise lead to rebirth in the Avīci hell.

source: མནར་མེད་པར་གཞོལ་བ་དེ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་ཅིང་བདེ་བླག་ཏུ་སངས་རྒྱས་ཉིད་དུ་འགྲོའོ།། །།
en: All their negativity will be destroyed, and they will swiftly attain buddhahood. “

source: དེ་ནས་དོན་ཡོད་པའི་ལྕགས་ཀྱུའི་ཆོ་ག་ཞིབ་མོ་ཆེན་པོ་དང་། ཁྲོ་བོ་ལྕགས་ཀྱུ་དང་།
en: Now I will teach, as part of this great rite of Amoghāṅkuśa, the mudrā of the sameness of all tathāgata families.

source: རིག་པའི་རྒྱལ་པོ་དང་། དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་དཀྱིལ་འཁོར་ཆེན་པོ་རུ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཐུན་མོང་པའི་ཕྱག་རྒྱ་དགེ་བའི་ལས་ཐམས་ཅད་བྱེད་པ།
en: I will teach it as part of this great maṇḍala that is the heart essence of Amoghapāśa in his form of the king of vidyās Krodhāṅkuśa.

source: འབྱུང་པོ་ཐམས་ཅད་སྐྲག་པར་བྱེད་པ། གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་འབྲོས་པར་བྱེད་པ། བགེགས་ཐམས་ཅད་རྣམ་པར་སྐྲག་པར་བྱེད་པ། འདོད་པའི་རིག་རྣམས་སྲེག་པར་བྱེད་པ།
en: This mudrā auspiciously accomplishes all activities, makes all bhūtas panic and flee, terrifies yakṣas and rākṣasas, and burns all vighnas with fire.

source: གདུག་པའི་ཀླུ་རྣམས་འཁྲུག་པར་བྱེད་པ། སའི་མཐིལ་གཡོ་བར་བྱེད་པ། ལྷའི་མེ་ཏོག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་མཛེས་པ་དང་། ལྷའི་གོས་དང་ལྷབ་ལྷུབ་ཀྱི་ཆར་འབེབས་པར་བྱེད་པ།
en: It makes the devas of the desire realm grow faint, makes wicked nāgas tremble and send rain upon the earth, and brings a rain of divine flowers, various jewels, divine clothes, and ornaments. “

source: དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་རྣམས་ཡང་དག་པར་སྐུལ་བར་བྱེད་པ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་སྙན་གསན་འབེབས་པར་བྱེད་པ།
en: This mudrā rouses all buddhas and invites the tathāgatas of the three times from throughout the ten directions.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ན་གནས་པའི་ལྷ་ཐམས་ཅད་སྤྱན་འདྲེན་པར་བྱེད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབུགས་འབྱིན་པར་བྱེད་པ།
en: It summons all the devas who dwell in the realm of Thirty-Three and enlivens all bodhisattvas.

source: རིག་པའི་རྒྱལ་པོ་དང་། དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་འགུགས་པར་བྱེད་པ།
en: It summons all the deities in the maṇḍala of the king of vidyās.

source: བདེ་བ་ཐམས་ཅད་དང་ཕྱིར་མི་ལྡོག་པའི་གནས་ཐོབ་པར་བྱེད་པ།
en: It brings all enjoyments and pleasures and establishes the vidyā holder irreversibly on the path to awakening.

source: བླ་ན་མེད་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་བྱེད་པ། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱེད་པ།
en: It brings the vidyā holder to the seat of ultimate awakening and compels him to turn the wheel of Dharma.

source: ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་བྱེད་པ། ཆོས་ཀྱི་དུང་འབུད་པར་བྱེད་པ། ཕྱག་རྒྱ་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་སྒྲེང་བར་བྱེད་པ།
en: It is the blazing light of the Dharma torch, the sound of the Dharma conch, and the raising of the Dharma banner.

source: ཆོ་ག་ཞིབ་མོ་དང་། གསང་སྔགས་བླ་ན་མེད་པ་ཐམས་ཅད་གྲུབ་པ།
en: It brings the ultimate accomplishment of all mantras and rites. “

source: འདོད་པ་ཐམས་ཅད་རབ་ཏུ་སྦྱིན་པ། ཕྱག་རྒྱ་དང་། མཆོག་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པ།
en: This mudrā makes all wishes come true and grants every boon.

source: གསང་སྔགས་ཐམས་ཅད་འཆང་བ། གཟུངས་རྣམས་ཀྱི་ཁྱད་པར་གྲུབ་པ།
en: It supports all mantras, and in particular it brings the accomplishment of dhāraṇīs.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུན་མོང་གི་གསང་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འཇུག་པར་བྱེད་པ། གང་གིས་རྣམ་པར་སྣང་མཛད་དང་།
en: It allows the vidyā holder to enter every maṇḍala and establish the secret samaya with all tathāgatas equally.

source: ཐུབ་པ་བརྒྱད་པའི་དམ་ཚིག་གི་གནས་ཐམས་ཅད་ལ་གནས་པ།
en: It allows him to enter all the places where the eight sages, Vairocana and so forth, are present.

source: སྡིག་པ་ཐམས་ཅད་ཉམས་པར་བྱེད་པ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱེད་པ། ཀུན་ནས་ཉོན་མོངས་པ་རྣམས་སྲེག་པར་བྱེད་པ།
en: It eradicates all wrongdoings, purifies all obscurations, and burns away all the afflictions.

source: རྟག་ཏུ་འཁོར་བ་ལས་འདོན་པར་བྱེད་པ། བདུད་དང་མ་རུངས་པ་རྣམས་ལས་སྒྲོལ་བ་པོ། རྟག་ཏུ་ཆོས་ཀྱི་ཟམ་སྟེགས་མཆོག །
en: It always pulls beings out of saṃsāra, rescues them from Māra and other wicked beings, and always serves as a supreme Dharma bridge.

source: རྒ་བ་དང་། སྐྱེ་བ་དང་། འཆི་བ་ལས་གྲོལ་བར་བྱེད་པ། སྲིད་པ་མི་བཟད་པ་སྟོན་པར་ནུས་པ། ཚུལ་ཁྲིམས་དང་།
en: It frees one from old age, death, and rebirth via an embryo into the terrible prison of existence. “

source: གཏོང་བ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱི་དྲི་ཞིམ་པོ་སྦྱིན་ཞིང་སྲུང་བར་བྱེད་པ།
en: This mudrā grants forbearance, beauty, discipline, renunciation, energy, meditative states, insight, and samādhi.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ། སྦྱིན་པའི་རིན་པོ་ཆེའི་ཕུང་པོ་ཆེན་པོ་རྟག་ཏུ་སྦྱིན་པ། རིན་པོ་ཆེའི་ཕུང་པོ་རྟག་ཏུ་སྦྱིན་པ།
en: It grants the mastery of the six perfections and always brings much wealth and many precious things.

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ལྷ་ཐམས་ཅད་ལ་མཆོད་པ་བྱེད་པ། བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: It can be used to worship all buddhas, bodhisattvas, and deities, and it fulfills all hopes.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་བྱིན་གྱིས་རློབ་པ། སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་རྣམ་པར་འཕྲུལ་བ་ཐམས་ཅད་སྟོན་པར་བྱེད་པ།
en: This mudrā conveys the blessing of all tathāgatas and reveals all samādhis that display illusion-like miracles.

source: གཟུགས་སྣ་ཚོགས་དང་། རྫུ་འཕྲུལ་སྣ་ཚོགས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐོང་བར་བྱེད་པ། རྫུ་འཕྲུལ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: It can conjure all forms, produces various magical creations, and hones magical powers.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཕྱག་རྒྱ་རབ་ཏུ་སྟོན་པར་བྱེད་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོ་འདི་ལ་གནས་པར་བྱེད་པ།
en: It reveals the nature of the dharmadhātu, which is the seat of tathāgatas’ miraculous creations.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་བ།
en: It is a magical tool of all tathāgatas that destroys all wicked beings.

source: མ་རུངས་པ་ཐམས་ཅད་དང་། གདོན་དང་ནད་ཐམས་ཅད་རྟག་ཏུ་རྣམ་པར་འཇིག་པར་བྱེད་པ། ཕྱིར་རྒོལ་བ་དང་། དགྲ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་ཟློག་པར་བྱེད་པ།
en: It always subdues grahas, cures all diseases, and restrains all adversaries, opponents, and foreign armies.

source: སྒྲུབ་པར་བྱེད་པའོ། །འཇིགས་པ་རྣམས་ཐམས་ཅད་དང་། འཇིགས་པ་མི་བཟད་པ་བརྒྱད་པོ་རྣམས་ཀྱིས་འཇིགས་པ་མེད་པའོ། །དུག་དང་། བྱད་སྟེམས་དང་།
en: It grants fearlessness to all afflicted by the terrible eight fears, destroys garas and kākhordas, and neutralizes poisonous potions.

source: ཕྱེ་མའི་སྦྱོར་བ་ཐམས་ཅད་ཉམས་པར་བྱེད་པར་ཐེ་ཙོམ་མེད་པ་ཞེས་བྱ་བ་བཤད་པར་བྱའོ།
en: There is no doubt about this. “

source: །ལག་པ་གཉིས་བཟློག་ནས། ལག་པ་གཉིས་ཀྱི་མཐེ་བོའི་སོར་མོ་དང་། སྡིགས་མཛུབ་གཉིས་བསྐུམས་ལ་སོར་མོ་གསུམ་བརྐྱང་ལ་སྙིང་གའི་གནས་སུ་གཞག་པར་བྱ་སྟེ།
en: To form this mudrā, both hands should be held in an inverse position at the heart, with the thumb and index fingers of both hands bent, and the other three fingers extended.

source: འདི་ནི་དོན་ཡོད་པའི་ལྕགས་ཀྱུའི་ཕྱག་རྒྱ་ཡིད་བཞིན་གྱི་ནོར་བུ་དང་མཉམ་པར་མཆོག་སྦྱིན་པ་སྟེ།
en: This is the mudrā of Amoghāṅkuśa, which is the same as a wish-fulfilling jewel that grants boons.

source: ཕྱག་རྒྱ་བརྒྱ་སྟོང་ཕྲག་བྱེ་བ་གཉིས་ཙམ་དུ་བཅིངས་པར་འགྱུར་རོ།
en: When it is displayed, it is as if two hundred thousand million mudrās are displayed.

source: །གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཕྱག་རྒྱ་དང་། པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། རྡོ་རྗེ་རིགས་ཀྱི་ཕྱག་རྒྱ་གང་ཡིན་པ་དང་། ནོར་བུའི་རིགས་ཀྱི་ཕྱག་རྒྱ་གང་ཡིན་པས་ཏེ།
en: These other mudrās are those that may belong to the tathāgata family, to the great lotus maṇḍala of the lotus family, to the vajra family, or to the jewel family.

source: ཕྱག་རྒྱ་སོ་སོ་སོ་སོ་བ་འདི་རྣམས་ཐམས་ཅད་ཕྱག་རྒྱ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་རྣམས་སུ་འགྱུར་རོ།
en: It is as if all these mudrās, numbering in the hundreds of thousands of millions, are displayed one by one. “

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་རབ་ཏུ་བྱེད་དོ།
en: This mudrā of Amoghāṅkuśa generates a great amount of merit and, like a wish-fulfilling jewel, grants boons.

source: །ཕྱག་རྒྱ་འདི་ནི་ཡིད་བཞིན་གྱི་ནོར་བུའི་མཆོག་སྦྱིན་པ་པོ་འཇིག་རྟེན་དབང་ཕྱུག་མགོན་པོ་དོན་ཡོད་པའི་སྙིང་པོའོ།
en: It constitutes the heart essence of the lokeśvara Lord, the protector of the world, and unfailingly accomplishes all activities.

source: །ཤིན་ཏུ་གསང་བའི་ལས་ཐམས་ཅད་དུ་དོན་ཡོད་པའོ། །དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བླ་ན་མེད་པ་དང་།
en: It is the most secret asset of all the tathāgatas of the three times.

source: རིགས་ཐུན་མོང་བའི་གསང་བ་དང་།
en: It reveals the secret samaya of the sameness of the tathāgata families.

source: དམ་ཚིག་ཐམས་ཅད་དུ་མཐོང་བའོ། །ཕྱག་རྒྱ་འདིའི་ད་ལྟར་པའི་འདོད་པ་ཐམས་ཅད་དང་། ཡིད་ཀྱི་ཤིང་རྟ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའོ། །མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར་བའོ།
en: When this mudrā is displayed, all wishes are realized, and every boon is granted. “

source: །ཕྱག་རྒྱ་འདི་ཉིད་ཀྱིས། གུང་མོའི་སོར་མོས་མཐེ་བོང་གི་སོར་མོ་བསྐུམས་ལ། སྡིགས་མཛུབ་ཀྱིས་བསྡིགས་པར་བྱ། མིང་མེད་དང་།
en: After forming this same mudrā, the vidyā holder should bend the thumb by pressing on it with the middle finger, make the threatening gesture with the index finger, and extend the ring and small finger while keeping them together.

source: མཐེ་ཆུང་དག་གཅིག་ཏུ་བརྐྱང་ལ། སེན་མོས་སེན་མོ་མཉམ་པར་བཞག་ནས། སྙིང་གའི་གནས་སུ་བཞག་སྟེ། ཁྲོ་བོའི་ལྟ་བ་དང་མཚུངས་པར་བཞག་པས་ཧཱུཾ་ཡིག་གིས་བཙིར་བར་བྱའོ།
en: With the fingernails pressing against each other, he should hold his hands against the middle of his chest, assume a wrathful gaze, and press his hands while pronouncing the syllable hūṁ.

source: །འདི་ནི་ཁྲོ་བོའི་ལྕགས་ཀྱུའི་ཕྱག་རྒྱ་ཁྲོ་བོ་ཐམས་ཅད་ཀྱི་མཆོག་དང་གཙོ་བོར་བརྗོད་པར་བྱ་སྟེ།
en: This is the mudrā of Krodhāṅkuśa, the best among all the wrathful mudrās.

source: རིགས་བྱེ་བ་སྟོང་ཕྲག་རྣམས་ཀྱི་ཐུན་མོང་བའི་ཕྱག་རྒྱ་ཐམས་ཅད་རབ་ཏུ་འཇུག་པར་འགྱུར་རོ།
en: By displaying this mudrā, he displays all the hundreds of thousands of millions of mudrās shared by the tathāgatas families. “

source: །ཕྱག་རྒྱ་འཛིན་པ་ཙམ་གྱིས་ཁྲོ་བོའི་ཕྱག་རྒྱ་དང་། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བརྗོད་པ་དང་། དེ་བཞིན་དུ་པདྨའི་རིགས་གང་ཡིན་པ་དང་། རྡོ་རྗེའི་རིགས་སུ་བརྗོད་པ་གང་ཡིན་པ་དང་། ཁྲོ་བོའི་རྡོ་རྗེ་དྲག་པོས་འཇིགས་པར་བྱེད་དོ།
en: As soon as he displays this mudrā, he displays all the wrathful mudrās that are said to belong to the tathāgata family and to the lotus family, and also the mudrās of vajra wrath—the intensely fierce mudrās said to belong to the vajra family.

source: །ཁྲོ་བོའི་རྒྱལ་པོ་འདི་ནི་ཐམས་ཅད་དུ་ཁྲོ་བོའི་རྒྱལ་པོར་བརྗོད་པར་བྱ་སྟེ། ནོར་བུའི་རིགས་གང་ཡིན་པའི་ཁྲོ་བོ་རྣམས་ཀྱི་ཕྱག་རྒྱ་རྣམས་གདུག་པ་རྣམས་འཇིགས་པ་སྦྱིན་པའོ།
en: When this wrathful king is displayed, all the wrathful mudrā kings are displayed, including the wrathful mudrās of the jewel family that obliterate wicked beings.

source: །ཐམས་ཅད་དུ་ཕྱག་རྒྱའི་གཙོ་བོ་ཞེས་བྱ་བ། ཁྲོ་བོའི་རྒྱལ་པོ་བླ་ན་མེད་པའོ།
en: This superior mudrā is declared to be the supreme wrathful king.

source: །དེ་བཞིན་དུ་ཁྲོ་བོའི་ལྕགས་ཀྱུའི་ཕྱག་རྒྱ་འདི་འཆིང་བཞིན་པ། རི་རབ་ལྷུན་པོ་བརྒྱ་སྟོང་ཕྲག་དང་། རྒྱ་མཚོ་ཡང་སྐེམས་པར་བྱེད་དོ།
en: By merely displaying this mudrā of Krodhāṅkuśa, the vidyā holder can crush hundreds of thousands of Sumeru mountains and dry up the surrounding oceans.

source: །རི་རབ་ལྷུན་པོའི་རི་ནི་རྡུལ་ཕྲ་རབ་ཇི་ལྟ་བར་རྣམ་པར་འཐོར་བར་བྱེད་དོ། །རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་སྐེམས་པར་བྱེད་དོ། །རི་དང་རི་བོ་ཡང་ཉམས་པར་བྱེད་དོ། །ལྷ་མ་ཡིན་མ་རུངས་པ་རྣམས་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། དེའི་གནས་ཀྱི་ཀླུ་མ་རུངས་པ་རྣམས་སྲེག་པར་བྱེད་དོ།
en: The Sumeru mountains will crumble into as many particles as there are atoms in the universe, all the oceans will dry up, and the mountains will be destroyed. “

source: །དེ་བཞིན་དུ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། །འབྱུང་པོ་དང་། གདོན་མ་རུངས་པ་དང་། །བགེགས་བྱེད་པའི་ལྷ་མ་རུངས་པ་གང་ཡིན་པ་དང་།
en: As soon as this mudrā is displayed, the wicked asuras, including Rāhu, the lord of asuras, will be burned along with their dwellings, as will the wicked nāgas and yakṣas, the terrible rākṣasas, bhūtas, and grahas, the wicked deities who create obstacles, and the devas from the realm of Māra.

source: བདུད་ཀྱི་རིགས་རྣམས་གཅིག་ཏུ་འབར་བར་འགྱུར་ལ།
en: Consumed by one immense blaze, they will be destroyed instantly.

source: ཕྱག་རྒྱ་འཛིན་པ་ཙམ་གྱིས་དེ་རྣམས་ཐམས་ཅད་རྟག་ཏུ་ཉམས་པར་བྱེད་ཅིང་།
en: They will all certainly perish.

source: སྐད་ཅིག་དེ་ལ་འཇིག་པར་བྱེད་དོ། །ཕྱག་རྒྱ་འཛིན་པ་ཙམ་གྱིས་ཕྱིར་རྒོལ་བ་དང་། དགྲ་དང་། དེ་བཞིན་དུ་མ་རུངས་པའི་སེམས་ཅན་འཇིགས་པར་བྱེད་པ་དེ་རྣམས་ཐམས་ཅད་སྐྱབས་སུ་འགྲོ་བར་བྱེད་དོ། །ཕྱག་རྒྱ་དང་།
en: As soon as the mudrā is displayed, all opponents, adversaries, and wicked beings will be struck with fear and seek refuge.

source: གསང་སྔགས་དང་། དཀྱིལ་འཁོར་ཐམས་ཅད་དུ། བྱ་བ་ཐམས་ཅད་འགྲུབ་པར་བྱེད་དོ།
en: All endeavors will turn successful, and all mudrās, mantras, maṇḍalas, and rites will become accomplished.

source: །ཐམས་ཅད་འགྲུབ་པ་དོན་ཡོད་ཅིང་དགེ་བ་ཐམས་ཅད་འགྲུབ་པར་བྱེད་དོ།
en: The practices will succeed without fail. “

source: །ཕྱག་རྒྱ་འདི་ཉིད་ལས་སྡིགས་མཛུབ་གཉིས་རྡོ་རྗེའི་རྣམ་པར་བསྐུམས་ལ།
en: After forming the first mudrā, the vidyā holder should fold his index fingers into the shape of a vajra scepter.

source: གུང་མོ་ཡུད་ཙམ་བསྐུམས་ཏེ། མིང་མེད་དང་། མཐེ་བོང་གིས་སོར་མོའི་སེན་མོས་སེན་མོ་མཉམ་གཞག་སྟེ།
en: Only the middle fingers should be folded in; the ring fingers and thumbs should be bent with their fingernails touching, and his little fingers should be extended.
